Обозначьте
порядок
вычисления
выражения
по
операциям
оригинал
11 * 2 ** 2 - 13 / 4 + 7
11 * (2 ** 2) - 13 / 4 + 7
(11 * (4)) - 13 / 4 + 7
(44) - (13 / 4) + 7
((44) - (3.25)) + 7
40.75 + 7
47.75

Используйте
стандартные
арифметические
операции
представьте
самое
большео
целое
число
используя
цифры
4, 4, 4

Напишите
функцию
to_float(num), которая
преобразует
любое
число
в
число
с
плавающей
точкой.Если
в
качестве
аргумента
передан
другой
тип
данных, она
возращает
"Невозможно преобразовать"


def to_float(num)
    if num // n(условие)
        то
        преобращует
        float(num)
    else num == float(num)
    иначе
    нет
