ЧИСЛА

Целые числа (int)
Числа с плавающей точкой (float)
десятичные дроби (decimal)
дробные числа (fraction)

Операторы:
Сложение (+)
Вычитание (-)
Деление с остатком (%)
Деление нецелых чисел (/)
Деление целых чисел (//)
Возведение в степень (**)

''' Какая операция с целыми числами никогда не дает в виде результата целое число?'''
'/' простое деление всегда возращает float

''' Отличаются ли чем-то варианты объявления целого числа: 1230 или int(1230) '''
 Ничем не отличаются
a = 1230
b = int(1230)

''' Перечислите все типы данных, которые потенциально можно преобразовать в целое число напрямую через функцию int() '''

int
float
bool
decimal
fraction
str

''' Какой тип данных получится в результате вычисления выражения 3 + 3.0 + 4? '''
10.0 - (class 'float')

''' Из каких трех элементов состоит тип данных float? '''

знак (+ -)
степень, десятки (e+5)
значимые числа (до запятой)

